"The Unarchiver/Unarchive To Current Folder" = "The Unarchiver/Kibontás a jelenlegi mappába";

"The Unarchiver/Unarchive To Desktop" = "The Unarchiver/Kibontás az Íróasztalra";

"The Unarchiver/Unarchive To..." = "The Unarchiver/Kibontás ide...";
